Revit 2027 API
ParameterTypeId.RbsProjectReporttypeParam Property
 "Report Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsProjectReporttypeParam { get; }
Public Shared ReadOnly Property RbsProjectReporttypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsProjectReporttypeParam {
	ForgeTypeId^ get ();
}
static member RbsProjectReporttypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace